lvx/base/DataProcessors/бит_ФормированиеПакетовЗаказовНаПроизводство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_ФормированиеПакетовЗаказовНаПроизводство</Name>
			<Comment>ЛТ6.15</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КаталогЗаказов_БазисРаскрой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокПакетныйЗаказНаПроизводство</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_ПакетЭтаповНаРаскрой</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧМатериалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТЧЗаготовки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НоменклатураГП</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаГП</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БукваРаскроя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

lvx/base/Documents/бит_ПакетЭтаповНаРаскрой.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_ПакетЭтаповНаРаскрой</Name>
			<Comment>ЛТ6.15</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВРЦ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРабочихЦентров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресВыгрузкиФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПроизводственныеЭтапы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказНаПроизводство</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство2_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтапПроизводства</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЭтапПроизводства2_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураВыходногоИзделия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаВыходногоИзделия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Заготовки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БукваРаскроя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Высота</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ширина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Метраж</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураГП</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаГП</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МатериалыРаскроя</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

lvx/base/DataProcessors/бит_ФормированиеПакетовЗаказовНаПроизводство/Forms/Форма/Ext/Form/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьКомпоновщикНастроек();
	Элементы.НеобходимоОбновитьДанные.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)  
	
	ОтобразитьПериодВЗаголовке();
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьПериодВЗаголовке()
	
	Если ЗначениеЗаполнено(ПериодОтбор.ДатаНачала) Или ЗначениеЗаполнено(НачалоДня(ПериодОтбор.ДатаОкончания)) Тогда
		ПериодСтрокой = ": " + СтроковыеФункции.ПредставлениеПериодаВТексте(ПериодОтбор.ДатаНачала, ПериодОтбор.ДатаОкончания, , Ложь);
	Иначе               
		ПериодСтрокой = "";
	КонецЕсли;
	
	ЭтаФорма.Заголовок = "(бит) Формирование пакетов заказов на производство" + ПериодСтрокой; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "УстановленОтбор_ФормированиеЗаказовНаПроизводствоПоПлану" Тогда
		
		Если ТипЗнч(Параметр) = Тип("Структура") Тогда
			КомпоновщикНастроекОтбор = Параметр.КомпоновщикНастроек;
			ПериодОтбор = Параметр.ПериодОтбор;
			ВыводитьВРазрезеВРЦ = Параметр.ВыводитьВРазрезеВРЦ;
			ДополнятьЭтапамиВыбранногоЗаказа = Параметр.ДополнятьЭтапамиВыбранногоЗаказа;
		КонецЕсли;

        ПолучитьОтборыСКДВФормуНаСервере();

	КонецЕсли;
	
КонецПроцедуры   

&НаКлиенте
Процедура ВыбратьПериодЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда 
		ПериодОтбор = Результат; 
		УстановитьПериодСКД();  
		ИзменитьДоступностьСтраниц(Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы  

&НаКлиенте
Процедура ПроизвольныеОтборыНажатие(Элемент)
	
	ПередатьОтборыФормыВСКДНаСервере();
	
	ПФ = Новый Структура;
	ПФ.Вставить("КомпоновщикНастроек"				, КомпоновщикНастроекОтбор);
	ПФ.Вставить("АдресСхемыКомпоновкиДанных"		, АдресСхемыКомпоновкиДанных);
	ПФ.Вставить("ТаблицаДинамическихПолей"			, АдресТаблицыДинамическихПолей);
	ПФ.Вставить("ПериодОтбор"						, ПериодОтбор); 
	ПФ.Вставить("ВыводитьВРазрезеВРЦ"				, ВыводитьВРазрезеВРЦ);
	ПФ.Вставить("ДополнятьЭтапамиВыбранногоЗаказа"	, ДополнятьЭтапамиВыбранногоЗаказа);

	ОткрытьФорму("Обработка.бит_ФормированиеПакетовЗаказовНаПроизводство.Форма.ФормаОтбор", ПФ, ЭтаФорма, УникальныйИдентификатор);
	
	ИзменитьДоступностьСтраниц(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура Отобрать(Команда)
	
	УдалитьСтарыеСтраницыИДанные();
	ОтобратьНаСервере();
	ИзменитьДоступностьСтраниц(Истина);

КонецПроцедуры

&НаКлиенте
Процедура Период(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	Диалог.Период = ПериодОтбор;
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры  

&НаКлиенте
Процедура СоединитьВПакет(Команда)
	
	//Если ТаблЭтапы.Количество() = 0 Тогда
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет данных для формирования пакета");
	//	Возврат;
	//КонецЕсли;
	
	Пакеты = ПодготовитьДанныеПакетовНаСервере();

	Если Пакеты.Количество() = 0 Тогда
		Сообщить("Не выбраны этапы для объединения в пакеты.");
		Возврат;
	КонецЕсли;

	// Пока только проверка результата.
	Сообщить("Подготовлено пакетов: " + Пакеты.Количество());

	// Позже здесь будет создание документов:
	// СоздатьДокументыПакетовНаСервере(Пакеты);
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьВРазрезеВРЦПриИзменении(Элемент)
	ИзменитьДоступностьСтраниц(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДоступностьСтраниц(Режим)
	
	Элементы.Страницы.Доступность = Режим;
	Элементы.НеобходимоОбновитьДанные.Видимость = Не Режим;
    Элементы.СоединитьВПакет.Доступность = Режим;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнятьЭтапамиВыбранногоЗаказаПриИзменении(Элемент)
	
	//ИзменитьДоступностьСтраниц(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)

	ИзменитьДоступностьСтраниц(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ВРЦПриИзменении(Элемент)
	
	ИзменитьДоступностьСтраниц(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	
	ИзменитьДоступностьСтраниц(Ложь);

КонецПроцедуры
 
#КонецОбласти

#Область ИнициализацияСКД	 

&НаСервере
Процедура ИнициализироватьКомпоновщикНастроек()
	
	СписокСвойств = ПолучитьСписокСвойствДляОтбора(); 
	ПолучитьТаблицуДинамическихПолей(СписокСвойств);
	
	СхемаКомпоновкиДанных = Обработки.бит_ФормированиеПакетовЗаказовНаПроизводство.ПолучитьМакет("МакетОтбор");
	
	ТекстЗапроса = ПостроитьДинамическийЗапросСКД(СхемаКомпоновкиДанных, СписокСвойств);
	
	НаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Найти("НаборДанных1");
	НаборДанных.Запрос = ТекстЗапроса;
	
	ДополнитьСхемуПолямиСвойств(СхемаКомпоновкиДанных, СписокСвойств);
	
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных);
	КомпоновщикНастроекОтбор.Инициализировать(ИсточникНастроек);
	КомпоновщикНастроекОтбор.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	
	НастроитьВидимостьПараметровСКД(СхемаКомпоновкиДанных);
	
	КомпоновщикНастроекОтбор.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	
	ДобавитьДинамическиеПоляВОтборыСКД();
	
КонецПроцедуры 

&НаСервере
Процедура НастроитьВидимостьПараметровСКД(СхемаКомпоновкиДанных)

    Для Каждого Параметр Из СхемаКомпоновкиДанных.Параметры Цикл
		Параметр.ВключатьВДоступныеПоля = Ложь;
    КонецЦикла;

КонецПроцедуры

#КонецОбласти 

#Область ДинамическаяСхемаСКД

&НаСервереБезКонтекста
Функция ПолучитьСписокСвойствДляОтбора()
	
	Возврат Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.РеквизитыХарактеристикДляОтборов);

КонецФункции

&НаСервере
Процедура ПолучитьТаблицуДинамическихПолей(СписокСвойств)

    Таблица = Новый ТаблицаЗначений;
    Таблица.Колонки.Добавить("ИмяПоля", Новый ОписаниеТипов("Строка"));
    Таблица.Колонки.Добавить("Свойство");
    Таблица.Колонки.Добавить("ТипЗначения");
    Таблица.Колонки.Добавить("ЭтоДополнительноеЗначение", Новый ОписаниеТипов("Булево"));

    Номер = 0;
    Для Каждого Свойство Из СписокСвойств Цикл
        Номер = Номер + 1;

        СтрокаТаблицы = Таблица.Добавить();
        СтрокаТаблицы.ИмяПоля = "ЗначениеДопСвойства" + Формат(Номер, "ЧГ=0");
        СтрокаТаблицы.Свойство = Свойство;
        СтрокаТаблицы.ТипЗначения = Свойство.ТипЗначения;
        СтрокаТаблицы.ЭтоДополнительноеЗначение = Свойство.ТипЗначения.СодержитТип(Тип("СправочникСсылка.ЗначенияСвойствОбъектов"));
    КонецЦикла;
	
	АдресТаблицыДинамическихПолей = ПоместитьВоВременноеХранилище(Таблица, Новый УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Функция ПостроитьДинамическийЗапросСКД(СхемаКомпоновкиДанных, СписокСвойств) 

	НаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Найти("НаборДанных1");
	Если НаборДанных = Неопределено Тогда
		ВызватьИсключение "Не найден набор данных НаборДанных1";
	КонецЕсли;

	ТекстЗапроса = НаборДанных.Запрос;

	ТекстПолейБаза = "";
	ТекстСоединенийБаза = "";
	ТекстПолейИтог = "";
	ТекстПолейГде = "";

	Номер = 0;
	Для Каждого Свойство Из СписокСвойств Цикл

		Номер = Номер + 1;

		ИмяСоединения = "ДопСвойствоВыходногоИзделия" + Формат(Номер, "ЧГ=0");
		ИмяПоля = "ЗначениеДопСвойства" + Формат(Номер, "ЧГ=0");
		ИмяПараметра = "СвойствоДопОтбора" + Формат(Номер, "ЧГ=0");

		ТекстПолейБаза = ТекстПолейБаза + "," + Символы.ПС + "	" + ИмяСоединения + ".Значение КАК " + ИмяПоля;

		ТекстСоединенийБаза = ТекстСоединенийБаза + Символы.ПС
			+ "		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК " + ИмяСоединения + Символы.ПС
			+ "		ПО " + ИмяСоединения + ".Ссылка = ЭтапПроизводства2_2ВыходныеИзделия.Характеристика" + Символы.ПС
			+ "			И " + ИмяСоединения + ".Свойство = &" + ИмяПараметра;

		ТекстПолейИтог = ТекстПолейИтог + "," + Символы.ПС + "	База." + ИмяПоля + " КАК " + ИмяПоля;

		ТекстПолейГде = ТекстПолейГде + "," + Символы.ПС + "	База." + ИмяПоля;
		
		//-------------------------------
		// добавим параметры вручную
		ПараметрСКД = СхемаКомпоновкиДанных.Параметры.Добавить();
		ПараметрСКД.Имя = ИмяПараметра;
		ПараметрСКД.ВключатьВДоступныеПоля = Ложь;
		ПараметрСКД.ОграничениеИспользования = Истина;
	КонецЦикла;

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "	//{ДОПОЛНИТЕЛЬНЫЕ_ПОЛЯ_БАЗА}", ТекстПолейБаза);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "	//{ДОПОЛНИТЕЛЬНЫЕ_СОЕДИНЕНИЯ_БАЗА}", ТекстСоединенийБаза);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "	//{ДОПОЛНИТЕЛЬНЫЕ_ПОЛЯ_ИТОГ}", ТекстПолейИтог);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "	//{ДОПОЛНИТЕЛЬНЫЕ_ПОЛЯ_ГДЕ}", ТекстПолейГде);

	Возврат ТекстЗапроса;

КонецФункции

&НаСервере
Процедура ДополнитьСхемуПолямиСвойств(СхемаКомпоновкиДанных, СписокСвойств) Экспорт

    НаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Найти("НаборДанных1");

    Если НаборДанных = Неопределено Тогда
        ВызватьИсключение "Не найден набор данных НаборДанных1";
    КонецЕсли;

    ТаблицаПолей = ПолучитьИзВременногоХранилища(АдресТаблицыДинамическихПолей);
    Для Каждого ОписаниеПоля Из ТаблицаПолей Цикл

        ИмяПоля = ОписаниеПоля.ИмяПоля;
        Если НаборДанных.Поля.Найти(ИмяПоля) <> Неопределено Тогда
            Продолжить;
        КонецЕсли;

        ПолеНабора = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
        ПолеНабора.Поле = ИмяПоля;
        ПолеНабора.ПутьКДанным = ИмяПоля;
        ПолеНабора.Заголовок = ПолучитьЗаголовокПоляСвойства(ОписаниеПоля.Свойство);
        ПолеНабора.ТипЗначения = ОписаниеПоля.ТипЗначения;

	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ДобавитьДинамическиеПоляВОтборыСКД()

    ТаблицаПолей = ПолучитьИзВременногоХранилища(АдресТаблицыДинамическихПолей);
    Для Каждого ОписаниеПоля Из ТаблицаПолей Цикл
        ДобавитьПолеВОтборСКД(ОписаниеПоля.ИмяПоля, СтрЗаменить(ОписаниеПоля.Свойство, " (Для характеристик)",  ""));
    КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ДобавитьПолеВОтборСКД(ИмяПоля, ПредставлениеПоля)

    Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Для Каждого ЭлементОтбора Из КомпоновщикНастроекОтбор.Настройки.Отбор.Элементы Цикл
        Если ЭлементОтбора.ЛевоеЗначение = Поле Тогда
            Возврат;
        КонецЕсли;
    КонецЦикла;

    ЭлементОтбора = КомпоновщикНастроекОтбор.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.Использование = Ложь;
    ЭлементОтбора.ЛевоеЗначение = Поле;
    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗаголовокПоляСвойства(Свойство)

    Возврат "Характеристика - " + СтрЗаменить(Строка(Свойство), " (Для характеристик)", "");

КонецФункции
	
&НаСервере
Функция ЗаполнитьПараметрыСвойствСКД(СписокСвойств)
	
	Номер = 0;
    Для Каждого Свойство Из СписокСвойств Цикл

        Номер = Номер + 1;
        ИмяПараметра = "СвойствоДопОтбора" + Формат(Номер, "ЧГ=0");
        КомпоновщикНастроекОтбор.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(ИмяПараметра, Свойство);

	КонецЦикла;
	
КонецФункции

#КонецОбласти

#Область ПередачаОтборовФормыВСКД

&НаСервере
Процедура ПередатьОтборыФормыВСКДНаСервере()
	
	УстановитьПериодСКД();
	
	ОтразитьСписокЗначенийВОтборахКомпоновки(КомпоновщикНастроекОтбор, "Подразделение", ПодразделениеОтбор);
	ОтразитьСписокЗначенийВОтборахКомпоновки(КомпоновщикНастроекОтбор, "Статус", СтатусОтбор);
	ОтразитьСписокЗначенийВОтборахКомпоновки(КомпоновщикНастроекОтбор, "ВидРабочегоЦентра", ВРЦОтбор);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПериодСКД()
	
	КомпоновщикНастроекОтбор.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Период", ПериодОтбор);
	ОтобразитьПериодВЗаголовке();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОтразитьСписокЗначенийВОтборахКомпоновки(КомпоновщикНастроек, ИмяПоля, СписокЗначений)
	
	сЗначений = Новый СписокЗначений;
	Для Каждого СтрокаСписка Из СписокЗначений Цикл
		Если ЗначениеЗаполнено(СтрокаСписка.Значение) Тогда
			сЗначений.Добавить(СтрокаСписка.Значение);
		КонецЕсли;
	КонецЦикла;
	
	ПолеПоиска = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Для Каждого Отбор Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если Отбор.ЛевоеЗначение 	= ПолеПоиска Тогда
			Отбор.ВидСравнения 		= ВидСравненияКомпоновкиДанных.ВСписке;
			Отбор.Использование 	= сЗначений.Количество() > 0;
			Отбор.ПравоеЗначение 	= сЗначений;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОтразитьПростойОтборВОтборахКомпоновки(КомпоновщикНастроекОтбор, ИмяПоля, Значение)
	
	ЗначениеПоиска = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Для Каждого Отбор Из КомпоновщикНастроекОтбор.Настройки.Отбор.Элементы Цикл
		Если Отбор.ЛевоеЗначение = ЗначениеПоиска Тогда
			Настройка = КомпоновщикНастроекОтбор.ПользовательскиеНастройки.Элементы.Найти(Отбор.ИдентификаторПользовательскойНастройки);
			Если Настройка <> Неопределено Тогда
				Настройка.Использование = ЗначениеЗаполнено(Значение);
				Если Настройка.Использование Тогда
					Настройка.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
					Настройка.ПравоеЗначение = Значение;
				КонецЕсли;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПолучениеОтборовСКДВФорму

&НаСервере
Процедура ПолучитьОтборыСКДВФормуНаСервере()
	
	ЗаполнитьСписокИзОтбораСКД(ПодразделениеОтбор, КомпоновщикНастроекОтбор, "Подразделение");
	ЗаполнитьСписокИзОтбораСКД(СтатусОтбор, КомпоновщикНастроекОтбор, "Статус");
	ЗаполнитьСписокИзОтбораСКД(ВРЦОтбор, КомпоновщикНастроекОтбор, "ВидРабочегоЦентра");
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьСписокИзОтбораСКД(СписокЗначений, КомпоновщикНастроек, ИмяПоля)
	
	ПравоеЗначение = ПолучитьЗначениеПростогоОтбораСКД(КомпоновщикНастроек, ИмяПоля);

	СписокЗначений.Очистить();
	
	Если ПравоеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ПравоеЗначение) = Тип("Массив") Тогда
		Для Каждого ЗначениеОтбора Из ПравоеЗначение Цикл
			НоваяСтрока = СписокЗначений.Добавить();
			НоваяСтрока.Пометка = Истина;
			НоваяСтрока.Значение = ЗначениеОтбора;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ПравоеЗначение) = Тип("СписокЗначений") Тогда 
		Для Каждого ЗначениеОтбора Из ПравоеЗначение Цикл
			НоваяСтрока = СписокЗначений.Добавить();
			НоваяСтрока.Пометка = Истина;
			НоваяСтрока.Значение = ЗначениеОтбора.Значение;
		КонецЦикла;
		
	Иначе
		
		НоваяСтрока = СписокЗначений.Добавить();
		НоваяСтрока.Пометка = Истина;
		НоваяСтрока.Значение = ПравоеЗначение;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначениеПростогоОтбораСКД(КомпоновщикНастроек, ИмяПоля)
	
	ПолеПоиска = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Для Каждого Отбор Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если Отбор.ЛевоеЗначение = ПолеПоиска Тогда
			Если Отбор.Использование Тогда
				Возврат Отбор.ПравоеЗначение;
			КонецЕсли;
			
		ИначеЕсли Отбор.ЛевоеЗначение = ИмяПоля Тогда
			Возврат Отбор.Использование;

		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область ВыполнениеОтбора

&НаСервере
Процедура ОтобратьНаСервере()
	
	ТаблЭтапы.Очистить();
	
	ПередатьОтборыФормыВСКДНаСервере();
	
	СписокСвойств = ПолучитьСписокСвойствДляОтбора();
	ЗаполнитьПараметрыСвойствСКД(СписокСвойств);
	
	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроекОтбор.ПолучитьНастройки(), , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , , Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;

	ТаблицаРезультата = Новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаРезультата);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	

	ТаблицаРезультата = ПолучитьЭтапыСДополнением(ТаблицаРезультата.ВыгрузитьКолонку("Этап"), ДополнятьЭтапамиВыбранногоЗаказа);
	
	УникальныеВРЦ = ТаблицаРезультата.Скопировать(, "ВидРабочегоЦентра");
	УникальныеВРЦ.Свернуть("ВидРабочегоЦентра");
	
	Если ТаблицаРезультата.количество() Тогда
		мСтраниц = УникальныеВРЦ.ВыгрузитьКолонку("ВидРабочегоЦентра");
		ВывестиСтраницы(мСтраниц);
		ЗаполнитьСтраницыДанными(ТаблицаРезультата); 
	Иначе
		УдалитьСтарыеСтраницыИДанные();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет данных для заполнения");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЭтапыСДополнением(МассивЭтапов, ДополнятьЭтапами)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивЭтапов", МассивЭтапов);
	Запрос.УстановитьПараметр("ДополнятьЭтапами", ДополнятьЭтапами);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Этапы.Ссылка КАК Этап,
	               |	Этапы.Распоряжение КАК ЗаказНаПроизводство,
	               |	докВыходныеИзделия.Назначение КАК Назначение
	               |ПОМЕСТИТЬ ИсходныеНазначения
	               |ИЗ
	               |	Документ.ЭтапПроизводства2_2 КАК Этапы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК докВыходныеИзделия
	               |		ПО (докВыходныеИзделия.Ссылка = Этапы.Ссылка)
	               |ГДЕ
	               |	Этапы.Ссылка В(&МассивЭтапов)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ИсходныеНазначения.Этап КАК Этап,
	               |	ЗаказНаПроизводство2_2Продукция.Номенклатура КАК НоменклатураОИ,
	               |	ЗаказНаПроизводство2_2Продукция.Характеристика КАК ХарактеристикаОИ
	               |ПОМЕСТИТЬ втОИпоЭтапу
	               |ИЗ
	               |	ИсходныеНазначения КАК ИсходныеНазначения
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство2_2 КАК ЗаказНаПроизводство2_2
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство2_2.Продукция КАК ЗаказНаПроизводство2_2Продукция
	               |			ПО (ЗаказНаПроизводство2_2Продукция.Ссылка = ЗаказНаПроизводство2_2.Ссылка)
	               |		ПО ИсходныеНазначения.ЗаказНаПроизводство = ЗаказНаПроизводство2_2.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ИсходныеНазначения.Этап КАК ИсходныйЭтап,
	               |	ИсходныеНазначения.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	               |	ИсходныеНазначения.Назначение КАК ИсходноеНазначение,
	               |	ЗаказНаПроизводство2_2Продукция.Номенклатура КАК Номенклатура,
	               |	ЗаказНаПроизводство2_2Продукция.Характеристика КАК Характеристика
	               |ПОМЕСТИТЬ ПродукцияПоИсходнымНазначениям
	               |ИЗ
	               |	ИсходныеНазначения КАК ИсходныеНазначения
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство2_2.Продукция КАК ЗаказНаПроизводство2_2Продукция
	               |		ПО (ЗаказНаПроизводство2_2Продукция.Ссылка = ИсходныеНазначения.ЗаказНаПроизводство)
	               |			И (ЗаказНаПроизводство2_2Продукция.Назначение = ИсходныеНазначения.Назначение)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ПродукцияПоИсходнымНазначениям.ИсходныйЭтап КАК ИсходныйЭтап,
	               |	ПродукцияПоИсходнымНазначениям.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	               |	ПродукцияПоИсходнымНазначениям.ИсходноеНазначение КАК ИсходноеНазначение,
	               |	ПродукцияДругихНазначений.Назначение КАК ДругоеНазначение
	               |ПОМЕСТИТЬ ДругиеНазначенияПоПродукции
	               |ИЗ
	               |	ПродукцияПоИсходнымНазначениям КАК ПродукцияПоИсходнымНазначениям
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство2_2.Продукция КАК ПродукцияДругихНазначений
	               |		ПО (ПродукцияДругихНазначений.Ссылка = ПродукцияПоИсходнымНазначениям.ЗаказНаПроизводство)
	               |			И (ПродукцияДругихНазначений.Номенклатура = ПродукцияПоИсходнымНазначениям.Номенклатура)
	               |			И (ПродукцияДругихНазначений.Характеристика = ПродукцияПоИсходнымНазначениям.Характеристика)
	               |			И (ПродукцияДругихНазначений.Назначение <> ПродукцияПоИсходнымНазначениям.ИсходноеНазначение)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ИсходныеНазначения.Этап КАК Этап,
	               |	ИсходныеНазначения.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	               |	ИсходныеНазначения.Назначение КАК Назначение
	               |ПОМЕСТИТЬ База
	               |ИЗ
	               |	ИсходныеНазначения КАК ИсходныеНазначения
	               |
				   // не будем выводить другие этапы. это будет при формировании пакета
				   //|ОБЪЕДИНИТЬ
				   //|
				   //|ВЫБРАТЬ РАЗЛИЧНЫЕ
				   //|	ЭтапыРаскроя.Ссылка,
				   //|	ДругиеНазначенияПоПродукции.ЗаказНаПроизводство,
				   //|	ДругиеНазначенияПоПродукции.ДругоеНазначение
				   //|ИЗ
				   //|	ДругиеНазначенияПоПродукции КАК ДругиеНазначенияПоПродукции
				   //|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2 КАК ЭтапыРаскроя
				   //|		ПО (ЭтапыРаскроя.Распоряжение = ДругиеНазначенияПоПродукции.ЗаказНаПроизводство)
				   //|			И (ЭтапыРаскроя.Этап.бит_ЭтоЭтапРаскроя = ИСТИНА)
				   //|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ВыходныеИзделияРаскроя
				   //|		ПО (ВыходныеИзделияРаскроя.Ссылка = ЭтапыРаскроя.Ссылка)
				   //|			И (ВыходныеИзделияРаскроя.Назначение = ДругиеНазначенияПоПродукции.ДругоеНазначение) 
				   //|
				   |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Трудозатраты.Ссылка КАК Этап,
	               |	МАКСИМУМ(Трудозатраты.ВидРабот) КАК ВидРабот
	               |ПОМЕСТИТЬ втВидыРабот
	               |ИЗ
	               |	Документ.ЭтапПроизводства2_2.Трудозатраты КАК Трудозатраты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ База КАК База
	               |		ПО (База.Этап = Трудозатраты.Ссылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Трудозатраты.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВидыРабочихЦентров.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
	               |	База.Этап КАК Этап
	               |ПОМЕСТИТЬ втВРЦ
	               |ИЗ
	               |	Документ.ЭтапПроизводства2_2.ВидыРабочихЦентров КАК ВидыРабочихЦентров
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ База КАК База
	               |		ПО (ВидыРабочихЦентров.Использовать)
	               |			И ВидыРабочихЦентров.Ссылка = База.Этап
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	АльтернативныеВРЦ.ВидРабочегоЦентра,
	               |	База.Этап
	               |ИЗ
	               |	Документ.ЭтапПроизводства2_2.АльтернативныеВидыРабочихЦентров КАК АльтернативныеВРЦ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ База КАК База
	               |		ПО (АльтернативныеВРЦ.Использовать)
	               |			И АльтернативныеВРЦ.Ссылка = База.Этап
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	База.Этап КАК Этап,
	               |	ЕСТЬNULL(ПроизводственныеЭтапы.Ссылка, ЗНАЧЕНИЕ(Документ.бит_ПакетЭтаповНаРаскрой.ПустаяСсылка)) КАК ПакетРаскроя
	               |ПОМЕСТИТЬ втПакетыРаскроя
	               |ИЗ
	               |	База КАК База
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_ПакетЭтаповНаРаскрой.ПроизводственныеЭтапы КАК ПроизводственныеЭтапы
	               |		ПО База.Этап = ПроизводственныеЭтапы.ЭтапПроизводства
	               |			И (ПроизводственныеЭтапы.Ссылка.Проведен)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	База.Этап КАК Этап, 
				   |	База.Назначение КАК Назначение, 
	               |	ЭтапПроизводства2_2.Статус КАК СостояниеЭтапа,
	               |	НАЧАЛОПЕРИОДА(ЭтапПроизводства2_2.Дата, ДЕНЬ) КАК ДатаЭтапа,
	               |	ЭтапПроизводства2_2.Распоряжение КАК ЗаказНаПроизводство,
	               |	втВРЦ.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
	               |	втВидыРабот.ВидРабот КАК ВидРабот,
	               |	ЛОЖЬ КАК Пометка,
	               |	ЭтапПроизводства2_2.КоличествоУпаковокПлан КАК Количество,
	               |	ЭтапПроизводства2_2.Спецификация.ОсновноеИзделиеНоменклатура.Наименование КАК Состав,
	               |	втПакетыРаскроя.ПакетРаскроя КАК ПакетРаскроя,
	               |	ЕСТЬNULL(СостоянияЭтаповПроизводства.СостояниеОбеспечения, ЗНАЧЕНИЕ(Перечисление.СостоянияОбеспеченияЭтапаПроизводства.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СостоянияОбеспеченияЭтапаПроизводства.ОжидаетсяОбеспечение) КАК Обеспечено,
	               |	втОИпоЭтапу.НоменклатураОИ КАК НоменклатураОИ,
	               |	втОИпоЭтапу.ХарактеристикаОИ КАК ХарактеристикаОИ
	               |ИЗ
	               |	База КАК База
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства2_2
	               |			ПРАВОЕ СОЕДИНЕНИЕ втОИпоЭтапу КАК втОИпоЭтапу
	               |			ПО втОИпоЭтапу.Этап = ЭтапПроизводства2_2.Ссылка
	               |		ПО (ЭтапПроизводства2_2.Ссылка = База.Этап)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втВРЦ КАК втВРЦ
	               |		ПО (втВРЦ.Этап = База.Этап)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втВидыРабот КАК втВидыРабот
	               |		ПО (втВидыРабот.Этап = База.Этап)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втПакетыРаскроя КАК втПакетыРаскроя
	               |		ПО (втПакетыРаскроя.Этап = База.Этап)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЭтаповПроизводства КАК СостоянияЭтаповПроизводства
	               |		ПО База.ЗаказНаПроизводство = СостоянияЭтаповПроизводства.Распоряжение
	               |			И База.Этап = СостоянияЭтаповПроизводства.Этап";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#Область Интерфейс_СтраницыВРЦ

&НаСервере
Процедура УдалитьСтарыеСтраницыИДанные()

	// 1. Удаляем элементы формы, созданные программно
	Для Каждого Элемент Из Элементы.Страницы.ПодчиненныеЭлементы Цикл
		Элементы.Удалить(Элемент);
	КонецЦикла;
	
	// 2. Удаляем реквизиты формы, созданные программно
	УдаляемыеРеквизиты = Новый Массив;
    мРеквизиты = ПолучитьРеквизиты();
	Для Каждого Реквизит Из мРеквизиты Цикл
		Если СтрНачинаетсяС(Реквизит.Имя, "АвтоВРЦ_") Тогда
			УдаляемыеРеквизиты.Добавить(Реквизит.Имя);
		КонецЕсли;
	КонецЦикла;

	Если УдаляемыеРеквизиты.Количество() > 0 Тогда
		ИзменитьРеквизиты(, УдаляемыеРеквизиты);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ВывестиСтраницы(мСтраниц = Неопределено)
	// Добавляем страницы по выбранным ВРЦ 
	Если мСтраниц = Неопределено Тогда
		мСтраниц = ВРЦОтбор.ВыгрузитьЗначения();
	КонецЕсли;
		
	Если ВыводитьВРазрезеВРЦ Тогда
		Для каждого текВРЦ из мСтраниц Цикл 
			Если ЗначениеЗаполнено(текВРЦ) Тогда 
				ИмяСтраницы = "АвтоВРЦ_СтраницаВРЦ_" + Строка(текВРЦ.УникальныйИдентификатор());
				ЗаголовокСтраницы = Строка(текВРЦ);
			Иначе                                                                    
				ИмяСтраницы = "АвтоВРЦ_СтраницаВРЦ_000000";
				ЗаголовокСтраницы = "<ВРЦ не задан>";
			КонецЕсли;
			ВывестиСтраницуВРЦ(ИмяСтраницы, ЗаголовокСтраницы);
		КонецЦикла;    
	Иначе                                                
		ИмяСтраницы = "АвтоВРЦ_СтраницаВРЦ";    
		ЗаголовокСтраницы = "";
		ВывестиСтраницуВРЦ(ИмяСтраницы, ЗаголовокСтраницы);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиСтраницуВРЦ(ИмяСтраницы, ЗаголовокСтраницы)
	
	ИмяДерева = "АвтоВРЦ_Дерево_" + ИмяСтраницы;

	ИмяВыбраноЭтапов = "АвтоВРЦ_ВыбраноЭтапов_" + ИмяСтраницы;
	ИмяВыбраноИзделий = "АвтоВРЦ_ВыбраноИзделий_" + ИмяСтраницы;
	ИмяТребуетсяЛистов = "АвтоВРЦ_ТребуетсяЛистов_" + ИмяСтраницы;

	// 1. Создаем реквизиты формы
	ДобавляемыеРеквизиты = Новый Массив;   
	КЧ15_3 = Новый КвалификаторыЧисла(15, 3);
	КЧ15_0 = Новый КвалификаторыЧисла(15, 0);
	
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(ИмяДерева, Новый ОписаниеТипов("ДеревоЗначений")));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(ИмяВыбраноЭтапов, Новый ОписаниеТипов("Число", КЧ15_0)));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(ИмяВыбраноИзделий, Новый ОписаниеТипов("Число", КЧ15_3)));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(ИмяТребуетсяЛистов, Новый ОписаниеТипов("Число", КЧ15_3)));

	ДобавитьРеквизитыКолонокДерева(ДобавляемыеРеквизиты, ИмяДерева); 
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);

	// 2. Создаем страницу
	Страница = Элементы.Добавить(ИмяСтраницы, Тип("ГруппаФормы"), Элементы.Страницы);
	Страница.Вид = ВидГруппыФормы.Страница;
	Страница.Заголовок = ЗаголовокСтраницы;

	// 3. Создаем таблицу дерева
	Таблица = Элементы.Добавить("АвтоВРЦ_Таблица_" + ИмяСтраницы, Тип("ТаблицаФормы"), Страница);

	Таблица.ПутьКДанным = ИмяДерева;
	Таблица.Отображение = ОтображениеТаблицы.Дерево;
	Таблица.ТолькоПросмотр = Ложь;
    Таблица.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВсеУровни;
    Таблица.УстановитьДействие("ПередНачаломДобавления", "ДеревоЭтапыПередНачаломДобавления");
	Таблица.УстановитьДействие("ПередУдалением", "ДеревоЭтапыПередУдалением");
	Таблица.ИзменятьПорядокСтрок = Ложь;
	Таблица.ИзменятьСоставСтрок = Ложь;
	Таблица.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	Таблица.РазрешитьНачалоПеретаскивания = Ложь;
	Таблица.РазрешитьПеретаскивание = Ложь;
	Таблица.УстановитьДействие("Выбор", "ТаблицаВыбор");
	
	// 4. Колонки дерева
	//ДобавитьКолонкуДерева(Таблица, ИмяДерева, "Документ", "Этап / пакет", Истина);  
	ДобавитьКолонкуДерева(Таблица, ИмяДерева, "ПредставлениеЗначения", "Дата исполнения / Пакет / Этап", Истина);
	ДобавитьКолонкуДерева(Таблица, ИмяДерева, "ВидРабот", "Вид работ", Истина);
	ДобавитьКолонкуДерева(Таблица, ИмяДерева, "Состав", "Состав", Истина);
	ДобавитьКолонкуДерева(Таблица, ИмяДерева, "СостояниеЭтапа", "Состояние", Истина);
	//ДобавитьКолонкуДерева(Таблица, ИмяДерева, "Обеспечено", "Обесп", Истина, Ложь);                
	
	//ДобавитьКолонкуДерева(Таблица, ИмяДерева, "КоличествоИзделий", "Количество изделий", Истина, Ложь);
	ДобавитьКолонкуДерева(Таблица, ИмяДерева, "ОбеспеченоКартинка", "Обесп", Истина);
	
	КолонкаВыбор = ДобавитьКолонкуДерева(Таблица, ИмяДерева, "ПометкаКартинка", "Пометка", Ложь);
	
	// 5. Группа итогов
	ГруппаИтоги = Элементы.Добавить("АвтоВРЦ_ГруппаИтоги_" + ИмяСтраницы, Тип("ГруппаФормы"), Страница);

	ГруппаИтоги.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаИтоги.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаИтоги.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;

	ДобавитьПолеИтога(ГруппаИтоги, ИмяВыбраноИзделий, "Выбрано изделий");
	ДобавитьПолеИтога(ГруппаИтоги, ИмяВыбраноЭтапов, "Выбрано этапов");
	ДобавитьПолеИтога(ГруппаИтоги, ИмяТребуетсяЛистов, "Для раскроя требуется листов");	
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	мИменПоля = СтрРазделить(Поле.Имя, "_");
	ИмяПоля = мИменПоля[мИменПоля.ВГраница()];
	Если ИмяПоля = "ПредставлениеЗначения" и Элемент.ТекущиеДанные.ТипСтроки = "Этап" Тогда
		ОткрытьЗначение(Элемент.ТекущиеДанные.Этап);
	ИначеЕсли ИмяПоля = "ПометкаКартинка" и Элемент.ТекущиеДанные.ТипСтроки = "Этап" Тогда
		ТекущиеДанные.Пометка = Не ТекущиеДанные.Пометка;
	    ТекущиеДанные.ПометкаКартинка = ?(ТекущиеДанные.Пометка, БиблиотекаКартинок.ФлагУстановлен, БиблиотекаКартинок.ФлагНеУстановлен);
		
		ИмяТаблицы = СтрЗаменить(Элемент.Имя, "_Пометка", "");
		Если Не ЗначениеЗаполнено(ТекущиеДанные.ПакетРаскроя) Тогда    
	        ЗаказНаПроизводство = ТекущиеДанные.ЗаказНаПроизводство;
			ДополнитьЭтапамиВыбранногоЗаказаНаСервере(ИмяТаблицы, 
													ЗаказНаПроизводство, 
													ТекущиеДанные.Пометка
													//, 
													//ТекущиеДанные.НоменклатураОИ, 
													//ТекущиеДанные.ХарактеристикаОИ
													);
		КонецЕсли;
	
		ПересчитатьИтогиСтраницыНаСервере(ИмяТаблицы);
	Иначе 
		СтандартнаяОбработка = Истина;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЭтапыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр) 
	
	Отказ = Истина;

КонецПроцедуры 

&НаКлиенте
Процедура ДеревоЭтапыПередУдалением(Элемент, Отказ)

	Отказ = Истина;

КонецПроцедуры

&НаСервере
Процедура ДополнитьЭтапамиВыбранногоЗаказаНаСервере(ИмяТаблицы, 
													ЗаказНаПроизводство, 
													ЗначениеПометки
													//, 
													//НоменклатураОИ, 
													//ХарактеристикаОИ
													)
	
	Если Не ЗначениеЗаполнено(ЗаказНаПроизводство) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяСтраницы = СтрЗаменить(ИмяТаблицы, "АвтоВРЦ_Таблица_", "");
	ИмяДерева = "АвтоВРЦ_Дерево_" + ИмяСтраницы;

	Дерево = ЭтаФорма[ИмяДерева];
	
	//мСегментыНоменклатурыДляОтбораВРезку = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.СегментыНоменклатурыДляОтбораВРезку, , Ложь);
	//ВходитВСегмент = Ложь;
	//Для каждого ТекСегмент из мСегментыНоменклатурыДляОтбораВРезку Цикл
	//	ВходитВСегмент = СегментыСервер.ВходитВСегмент(НоменклатураОИ, ТекСегмент, , ТекСегмент.СпособФормирования = Перечисления.СпособыФормированияСегментов.ФормироватьДинамически);   
	//	Если ВходитВСегмент Тогда
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
	
	УстановитьПометкуПоЗаказуНаПроизводство(Дерево.ПолучитьЭлементы(), 
											ЗаказНаПроизводство, 
											ЗначениеПометки, 
											ДополнятьЭтапамиВыбранногоЗаказа
											//, 
											//НоменклатураОИ, 
											//ХарактеристикаОИ,
											//ВходитВСегмент,
											//мСегментыНоменклатурыДляОтбораВРезку
											);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗаказВыбраннойСтрокиДерева(Строки)

	Для Каждого СтрокаДерева Из Строки Цикл

		Если СтрокаДерева.ТипСтроки = "Этап" И СтрокаДерева.Пометка Тогда
			Возврат СтрокаДерева.ЗаказНаПроизводство;
		КонецЕсли;

		ЗаказНаПроизводство = ПолучитьЗаказВыбраннойСтрокиДерева(СтрокаДерева.ПолучитьЭлементы());

		Если ЗначениеЗаполнено(ЗаказНаПроизводство) Тогда
			Возврат ЗаказНаПроизводство;
		КонецЕсли;

	КонецЦикла;

	Возврат Неопределено;

КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьПометкуПоЗаказуНаПроизводство(Строки, 
												ЗаказНаПроизводство, 
												ЗначениеПометки, 
												ДополнятьЭтапамиВыбранногоЗаказа
												//, 
												//НоменклатураОИ, 
												//ХарактеристикаОИ,
												//ВходитВСегмент,
												//мСегментыНоменклатурыДляОтбораВРезку
												)
	
	//--------------------------------------------------------------
	Для Каждого СтрокаДерева Из Строки Цикл
		Если СтрокаДерева.ТипСтроки <> "Этап" Тогда
			Продолжить;
		КонецЕсли;
			
		Если ДополнятьЭтапамиВыбранногоЗаказа Тогда
			Если СтрокаДерева.ЗаказНаПроизводство = ЗаказНаПроизводство И Не ЗначениеЗаполнено(СтрокаДерева.ПакетРаскроя) Тогда
            	СтрокаДерева.Пометка = ЗначениеПометки;
				СтрокаДерева.ПометкаКартинка = ?(ЗначениеПометки, БиблиотекаКартинок.ФлагУстановлен, БиблиотекаКартинок.ФлагНеУстановлен);
				
				УстановитьПометкуПоЗаказуНаПроизводство(СтрокаДерева.ПолучитьЭлементы(), 
														ЗаказНаПроизводство, 
														ЗначениеПометки, 
														ДополнятьЭтапамиВыбранногоЗаказа
														//, 
														//НоменклатураОИ, 
														//ХарактеристикаОИ,
														//ВходитВСегмент,
														//мСегментыНоменклатурыДляОтбораВРезку
														);
				
			КонецЕсли;
		//Иначе  
		//	Если ВходитВСегмент Тогда
		//		НоменклатурыПоЗаказуНаПроизводство();		
		//	КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ДобавитьРеквизитыКолонокДерева(ДобавляемыеРеквизиты, ИмяДерева)
	
	ТипСтрока250 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(250));
	ТипБулево = Новый ОписаниеТипов("Булево");
	СоответствиеТипов = Новый Структура;
	СоответствиеТипов.Вставить("ТипСтроки"			, Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(20)));
	СоответствиеТипов.Вставить("ПредставлениеЗначения"	, ТипСтрока250);
	СоответствиеТипов.Вставить("ДатаЭтапа"			, Новый ОписаниеТипов("Дата"));
	СоответствиеТипов.Вставить("Документ"			, ТипСтрока250);
	СоответствиеТипов.Вставить("Этап"				, Новый ОписаниеТипов("ДокументСсылка.ЭтапПроизводства2_2"));
	СоответствиеТипов.Вставить("СостояниеЭтапа"		, Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыЭтаповПроизводства2_2"));
	СоответствиеТипов.Вставить("ВидРабот"			, Новый ОписаниеТипов("СправочникСсылка.ВидыРаботСотрудников"));
	СоответствиеТипов.Вставить("Обеспечено"			, ТипБулево);
	СоответствиеТипов.Вставить("Пометка"			, ТипБулево);
	СоответствиеТипов.Вставить("ПометкаКартинка"	, Новый ОписаниеТипов("Картинка"));
	СоответствиеТипов.Вставить("ЗаказНаПроизводство", Новый ОписаниеТипов("ДокументСсылка.ЗаказНаПроизводство2_2"));
	СоответствиеТипов.Вставить("ВидРабочегоЦентра"	, Новый ОписаниеТипов("СправочникСсылка.ВидыРабочихЦентров"));
	СоответствиеТипов.Вставить("Состав"				, ТипСтрока250);
	СоответствиеТипов.Вставить("ОбеспеченоКартинка" , Новый ОписаниеТипов("Картинка"));
	СоответствиеТипов.Вставить("КоличествоИзделий"  , Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15,3))); 
	СоответствиеТипов.Вставить("ПакетРаскроя"  		, Новый ОписаниеТипов("ДокументСсылка.бит_ПакетЭтаповНаРаскрой"));
    СоответствиеТипов.Вставить("НоменклатураОИ"		, Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	СоответствиеТипов.Вставить("ХарактеристикаОИ"	, Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));  
	СоответствиеТипов.Вставить("Назначение"			, Новый ОписаниеТипов("СправочникСсылка.Назначения"));

	Для каждого стр из СоответствиеТипов Цикл
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(стр.Ключ, стр.Значение, ИмяДерева));		
	КонецЦикла;                      
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтраницыДанными(ТаблицаРезультата)

	Для Каждого Страница Из Элементы.Страницы.ПодчиненныеЭлементы Цикл
		
		Если Не СтрНачинаетсяС(Страница.Имя, "АвтоВРЦ_СтраницаВРЦ") Тогда
			Продолжить;
		КонецЕсли;

		ИмяДерева = "АвтоВРЦ_Дерево_" + Страница.Имя;
		Дерево = ЭтаФорма[ИмяДерева];

		ВРЦ = Неопределено;

		Если ВыводитьВРазрезеВРЦ Тогда
			ВРЦ = ПолучитьВРЦПоИмениСтраницы(Страница.Имя);
		КонецЕсли;

		ЗаполнитьДеревоЭтаповСтраницы(Дерево, ТаблицаРезультата, ВРЦ);
		ПересчитатьИтогиСтраницыНаСервере("АвтоВРЦ_Таблица_" + Страница.Имя);

	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПолучитьВРЦПоИмениСтраницы(ИмяСтраницы)

	Если Не СтрНачинаетсяС(ИмяСтраницы, "АвтоВРЦ_СтраницаВРЦ_") Тогда
		Возврат Неопределено;
	КонецЕсли;

	UIDСтрокой = СтрЗаменить(ИмяСтраницы, "АвтоВРЦ_СтраницаВРЦ_", "");

	Если UIDСтрокой = "000000" Тогда
		Возврат Неопределено;
	КонецЕсли;

	Для Каждого ЭлементСписка Из ВРЦОтбор Цикл
		
		Если Не ЗначениеЗаполнено(ЭлементСписка.Значение) Тогда
			Продолжить;
		КонецЕсли;

		Если Строка(ЭлементСписка.Значение.УникальныйИдентификатор()) = UIDСтрокой Тогда
			Возврат ЭлементСписка.Значение;
		КонецЕсли;

	КонецЦикла;

	Возврат Неопределено;

КонецФункции

&НаСервере
Функция ДобавитьКолонкуДерева(Таблица, ИмяДерева, ИмяКолонки, Заголовок, ТолькоПросмотр, Видимость = Истина)

	Колонка = Элементы.Добавить(Таблица.Имя + "_" + ИмяКолонки, Тип("ПолеФормы"), Таблица);

	Колонка.Вид = ВидПоляФормы.ПолеВвода;
	Колонка.ПутьКДанным = ИмяДерева + "." + ИмяКолонки;
	Колонка.Заголовок = Заголовок;
	Колонка.ТолькоПросмотр = ТолькоПросмотр;
    Колонка.Видимость = Видимость;
	
	Возврат Колонка;

КонецФункции

&НаСервере
Процедура ДобавитьПолеИтога(Родитель, ИмяРеквизита, Заголовок)

	Поле = Элементы.Добавить("АвтоВРЦ_Поле_" + ИмяРеквизита, Тип("ПолеФормы"), Родитель);
	Поле.Вид = ВидПоляФормы.ПолеВвода;
	Поле.ПутьКДанным = ИмяРеквизита;
	Поле.Заголовок = Заголовок;
	Поле.ТолькоПросмотр = Истина;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоЭтаповСтраницы(Дерево, ТаблицаРезультата, ВРЦ)

	Таблица = ТаблицаРезультата.Скопировать();
    Таблица.Сортировать("ВидРабочегоЦентра, ДатаЭтапа, ЗаказНаПроизводство, ПакетРаскроя, Этап");

	Если ВыводитьВРазрезеВРЦ И ЗначениеЗаполнено(ВРЦ) Тогда
		мСтрок = Таблица.НайтиСтроки(Новый Структура("ВидРабочегоЦентра", ВРЦ));
		ЗаполнитьДеревоЭтаповСтраницыФрагмент(Дерево, мСтрок);
	Иначе
		ЗаполнитьДеревоЭтаповСтраницыФрагмент(Дерево, Таблица);	
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоЭтаповСтраницыФрагмент(Дерево, КоллекцияСтрок)
	
	Для Каждого СтрокаДанных Из КоллекцияСтрок Цикл
		
		УзелДата = НайтиИлиСоздатьУзелДаты(Дерево, СтрокаДанных.ДатаЭтапа);
		Если ЗначениеЗаполнено(СтрокаДанных.ПакетРаскроя) Тогда
			УзелДокумент = НайтиИлиСоздатьУзелДокумента(УзелДата, СтрокаДанных.ПакетРаскроя, "Пакет");
			
			УзелЭтап = УзелДокумент.ПолучитьЭлементы().Добавить();
			ЗаполнитьСтрокуЭтапа(УзелЭтап, СтрокаДанных);
		Иначе
			УзелЭтап = УзелДата.ПолучитьЭлементы().Добавить();
			ЗаполнитьСтрокуЭтапа(УзелЭтап, СтрокаДанных);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры 

&НаСервере
Функция НайтиИлиСоздатьУзелДаты(Дерево, ДатаЭтапа)

	ДатаДня = НачалоДня(ДатаЭтапа);  
	СтрокиДерева = Дерево.ПолучитьЭлементы();

	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		Если СтрокаДерева.ТипСтроки = "Дата" И СтрокаДерева.ДатаЭтапа = ДатаДня Тогда
			Возврат СтрокаДерева;
		КонецЕсли;
	КонецЦикла;

	СтрокаДерева = Дерево.ПолучитьЭлементы().Добавить();
	СтрокаДерева.ТипСтроки = "Дата";
	СтрокаДерева.ДатаЭтапа = ДатаДня;
	СтрокаДерева.Документ = ДатаДня;  
	СтрокаДерева.ПредставлениеЗначения = Формат(ДатаДня, "ДФ=dd.MM.yyyy");

	Возврат СтрокаДерева;

КонецФункции

&НаСервереБезКонтекста
Функция НайтиИлиСоздатьУзелДокумента(УзелРодитель, Документ, ТипСтроки)
	
	СтрокиДерева = УзелРодитель.ПолучитьЭлементы();
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		Если СтрокаДерева.ТипСтроки = ТипСтроки И СтрокаДерева.Документ = Документ Тогда
			Возврат СтрокаДерева;
		КонецЕсли;
	КонецЦикла;

	СтрокаДерева = УзелРодитель.ПолучитьЭлементы().Добавить();
	СтрокаДерева.ТипСтроки = ТипСтроки;
	СтрокаДерева.Документ = Документ;
    СтрокаДерева.ПредставлениеЗначения = Строка(Документ);
	
	Возврат СтрокаДерева;

КонецФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьСтрокуЭтапа(СтрокаДерева, СтрокаДанных)

	СтрокаДерева.ТипСтроки = "Этап";  
	ЗаполнитьЗначенияСвойств(СтрокаДерева, СтрокаДанных);                            
	
	ПредставлениеКоличества = Формат(СтрокаДанных.Количество, "ЧДЦ=3; ЧРД=,; ЧГ=0");

	Если СтрНайти(ПредставлениеКоличества, ",") > 0 Тогда

		Пока Прав(ПредставлениеКоличества, 1) = "0" Цикл
			ПредставлениеКоличества = Лев(ПредставлениеКоличества, СтрДлина(ПредставлениеКоличества) - 1);
		КонецЦикла;

		Если Прав(ПредставлениеКоличества, 1) = "," Тогда
			ПредставлениеКоличества = Лев(ПредставлениеКоличества, СтрДлина(ПредставлениеКоличества) - 1);
		КонецЕсли;

	КонецЕсли;                   
	
	СтрокаДерева.Состав = ПредставлениеКоличества + " поз: " + СтрокаДерева.Состав;
	
	СтрокаДерева.ПакетРаскроя = СтрокаДанных.ПакетРаскроя;
	
	СтрокаДерева.НоменклатураОИ = СтрокаДанных.НоменклатураОИ;
	СтрокаДерева.ХарактеристикаОИ = СтрокаДанных.ХарактеристикаОИ;
	СтрокаДерева.Назначение = 
	СтрокаДерева.КоличествоИзделий = СтрокаДанных.Количество;
	СтрокаДерева.Документ = СтрокаДанных.Этап; 
	
	СтрокаДерева.ПредставлениеЗначения = Строка(СтрокаДанных.Этап);
	
	Если СтрокаДерева.Обеспечено Тогда
        СтрокаДерева.ОбеспеченоКартинка = БиблиотекаКартинок.ПустаяКартинка;
	Иначе
		СтрокаДерева.ОбеспеченоКартинка = БиблиотекаКартинок.КрасныйШар;
    КонецЕсли;

    Если СтрокаДерева.Пометка Тогда
        СтрокаДерева.ПометкаКартинка = БиблиотекаКартинок.ФлагУстановлен;
	Иначе
		СтрокаДерева.ПометкаКартинка = БиблиотекаКартинок.ФлагНеУстановлен;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПересчитатьИтогиСтраницыНаСервере(ИмяТаблицы)

	ИмяСтраницы = СтрЗаменить(ИмяТаблицы, "АвтоВРЦ_Таблица_", "");

	ИмяДерева = "АвтоВРЦ_Дерево_" + ИмяСтраницы;

	ИмяВыбраноЭтапов = "АвтоВРЦ_ВыбраноЭтапов_" + ИмяСтраницы;
	ИмяВыбраноИзделий = "АвтоВРЦ_ВыбраноИзделий_" + ИмяСтраницы;
	ИмяТребуетсяЛистов = "АвтоВРЦ_ТребуетсяЛистов_" + ИмяСтраницы;

	ВыбраноЭтапов = 0;
	ВыбраноИзделий = 0;
	ТребуетсяЛистов = 0;

	Дерево = ЭтаФорма[ИмяДерева];

	ПересчитатьИтогиПоСтрокамДерева(Дерево.ПолучитьЭлементы(), ВыбраноЭтапов, ВыбраноИзделий, ТребуетсяЛистов);

	ЭтаФорма[ИмяВыбраноЭтапов] = ВыбраноЭтапов;
	ЭтаФорма[ИмяВыбраноИзделий] = ВыбраноИзделий;
	ЭтаФорма[ИмяТребуетсяЛистов] = ТребуетсяЛистов;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПересчитатьИтогиПоСтрокамДерева(Строки, ВыбраноЭтапов, ВыбраноИзделий, ТребуетсяЛистов)
	
	СтандартныйРазмерМатериалаВысота = Справочники.бит_ЗначенияПоУмолчанию.СтандартныйРазмерМатериалаВысота;
	СтандартныйРазмерМатериалаШирина = Справочники.бит_ЗначенияПоУмолчанию.СтандартныйРазмерМатериалаШирина;
	
	РазмерМатериалаВысота = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(СтандартныйРазмерМатериалаВысота, , Истина);
	РазмерМатериалаШирина = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(СтандартныйРазмерМатериалаШирина, , Истина);
	Если ЗначениеЗаполнено(РазмерМатериалаВысота) и ЗначениеЗаполнено(РазмерМатериалаШирина) Тогда
		ПлощадьЛиста = РазмерМатериалаВысота * РазмерМатериалаШирина;
	Иначе
		ПлощадьЛиста = 0;
	КонецЕсли;
	
	Для Каждого СтрокаДерева Из Строки Цикл

		Если СтрокаДерева.ТипСтроки = "Этап" И СтрокаДерева.Пометка Тогда

			ВыбраноЭтапов = ВыбраноЭтапов + 1;
			ВыбраноИзделий = ВыбраноИзделий + СтрокаДерева.КоличествоИзделий;
			
			Если ПлощадьЛиста > 0 Тогда
				Потребность = РассчитатьПотребность(СтрокаДерева.Этап);
			    ТребуетсяЛистов = ТребуетсяЛистов + Потребность / ПлощадьЛиста;
			КонецЕсли;

		КонецЕсли;

		ПересчитатьИтогиПоСтрокамДерева(СтрокаДерева.ПолучитьЭлементы(), ВыбраноЭтапов, ВыбраноИзделий, ТребуетсяЛистов);

	КонецЦикла;

КонецПроцедуры                                  

&НаСервереБезКонтекста
Функция РассчитатьПотребность(Этап)

	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	СУММА(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество) КАК ПотребностьВМатериале
	                      |ИЗ
	                      |	Справочник.бит_ЗначенияПоУмолчанию.Значения КАК бит_ЗначенияПоУмолчаниюЗначения
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2.ОбеспечениеМатериаламиИРаботами КАК ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами
	                      |		ПО бит_ЗначенияПоУмолчаниюЗначения.Значение = ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура.ВидНоменклатуры
	                      |ГДЕ
	                      |	бит_ЗначенияПоУмолчаниюЗначения.Ссылка = ЗНАЧЕНИЕ(Справочник.бит_ЗначенияПоУмолчанию.ВидыНоменклатурыМатериаловРаскроя)
	                      |	И ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка = &Этап");
	Запрос.УстановитьПараметр("Этап", Этап);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПотребностьВМатериале;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПостобработкаВыбораСтроки(Элемент)

	// Заглушка.
	// Здесь позже будет логика:
	// - выбрать связанные этапы;
	// - снять выбор с несовместимых строк;
	// - отметить строки внутри пакета;
	// - проверить заказ / ВРЦ / подразделение.

КонецПроцедуры 

#КонецОбласти

#Область СозданиеПакетов
 
&НаСервере
Функция ПодготовитьДанныеПакетовНаСервере()

	ПакетыПоКлючу = Новый Соответствие;

	Для Каждого РеквизитФормы Из ПолучитьРеквизиты() Цикл

		Если Не СтрНачинаетсяС(РеквизитФормы.Имя, "АвтоВРЦ_Дерево_АвтоВРЦ_СтраницаВРЦ") Тогда
			Продолжить;
		КонецЕсли;

		Дерево = ЭтаФорма[РеквизитФормы.Имя];

		СобратьВыбранныеЭтапыВДереве(Дерево.Строки, ПакетыПоКлючу);

	КонецЦикла;

	Результат = Новый Массив;

	Для Каждого ЭлементПакета Из ПакетыПоКлючу Цикл
		Результат.Добавить(ЭлементПакета.Значение);
	КонецЦикла;

	Возврат Результат;

КонецФункции

&НаСервере
Процедура СобратьВыбранныеЭтапыВДереве(СтрокиДерева, ПакетыПоКлючу)

	Для Каждого СтрокаДерева Из СтрокиДерева Цикл

		Если СтрокаДерева.ТипСтроки = "Этап"
			И СтрокаДерева.Выбор Тогда

			ДобавитьЭтапВПакет(СтрокаДерева, ПакетыПоКлючу);

		КонецЕсли;

		Если СтрокаДерева.Строки.Количество() > 0 Тогда
			СобратьВыбранныеЭтапыВДереве(СтрокаДерева.Строки, ПакетыПоКлючу);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ДобавитьЭтапВПакет(СтрокаДерева, ПакетыПоКлючу)

	Ключ = ПолучитьКлючПакета(СтрокаДерева.Организация, СтрокаДерева.Подразделение, СтрокаДерева.ВидРабочегоЦентра);

	Если Не ПакетыПоКлючу.Получить(Ключ) = Неопределено Тогда
		Пакет = ПакетыПоКлючу.Получить(Ключ);
	Иначе
		Пакет = Новый Структура;

		Пакет.Вставить("Организация", СтрокаДерева.Организация);
		Пакет.Вставить("Подразделение", СтрокаДерева.Подразделение);
		Пакет.Вставить("ВидРабочегоЦентра", СтрокаДерева.ВидРабочегоЦентра);
		Пакет.Вставить("Этапы", Новый Массив);

		ПакетыПоКлючу.Вставить(Ключ, Пакет);
	КонецЕсли;

	ДанныеЭтапа = Новый Структура;

	ДанныеЭтапа.Вставить("ЭтапПроизводства", СтрокаДерева.Этап);
	ДанныеЭтапа.Вставить("Дата", СтрокаДерева.Дата);
	ДанныеЭтапа.Вставить("ЗаказКлиента", СтрокаДерева.ЗаказКлиента);
	ДанныеЭтапа.Вставить("ЗаказНаПроизводство", СтрокаДерева.ЗаказНаПроизводство);
	ДанныеЭтапа.Вставить("Статус", СтрокаДерева.Статус);
	ДанныеЭтапа.Вставить("ВидРабот", СтрокаДерева.ВидРабот);
	ДанныеЭтапа.Вставить("КоличествоИзделий", СтрокаДерева.КоличествоИзделий);

	Пакет.Этапы.Добавить(ДанныеЭтапа);

КонецПроцедуры   

&НаСервереБезКонтекста
Функция ПолучитьКлючПакета(Организация, Подразделение, ВидРабочегоЦентра)

	Возврат Строка(Организация) 
		+ "|" + Строка(Подразделение)
		+ "|" + Строка(ВидРабочегоЦентра);

КонецФункции

#КонецОбласти
